# Документация
### PlainPhpFramework

## Создание роутов
Роуты создаются в файле routes.php, а также имеют два публичных метода - get и post. Вы можете посмотреть использование на примере

## Создание контроллеров
Контроллеры создаются в директории app/Controllers/, наследуясь от App\Controllers\Controller. Вы можете создавать публичные методы, позже вызывая их в routes.php

## Создание представлений
Вы можете создать view файл в директории views/ в корне проекта. Вызывая функцию view, передавая в нее название представления без .php, а также необходимые переменные в формате ассоциативного массива или функции compact(), вы получите строку, представляющую из себя текстовый вывод (представление) из указанного файла